<?php
$lang['addarticle'] = 'Προσθήκη άρθρου';
$lang['addcategory'] = 'Προσθήκη Κατηγορίας';
$lang['addnewsitem'] = 'Προσθήκη νέας είδησης';
$lang['allcategories'] = 'Εμφάνιση όλων των κατηγοριών';
$lang['allentries'] = 'Εμφάνιση όλων των εγγραφών';
$lang['areyousure'] = 'Είστε σίγουροι για την διαγραφή?';
$lang['articles'] = 'Άρθρα';
$lang['cancel'] = 'Ακύρωση';
$lang['category'] = 'Κατηγορία';
$lang['categories'] = 'Κατηγορίες';
$lang['content'] = 'Περιεχόμενο';
$lang['dateformat'] = 'Η ημερομηνία %s δεν έχει την έγκυρη μορφή yyyy-mm-dd hh:mm:ss';
$lang['delete'] = 'Διαγραφή';
$lang['description'] = 'Προσθήκη,Επεξεργασία και κατάργηση Ειδήσεων';
$lang['detailtemplate'] = 'Μορφή κυρίως προτύπου';
$lang['displaytemplate'] = 'Πρότυπο Εμφάνισης';
$lang['edit'] = 'Επεξεργασία';
$lang['enddate'] = 'Τελική ημερομηνία';
$lang['endrequiresstart'] = 'Η εισαγωγή μιας τελικής ημερομηνίας προυποθέτει την εισαγωγή μιας αρχικής';
$lang['entries'] = '%s Εγγραφές';
$lang['status'] = 'Κατάσταση';
$lang['expiry'] = 'Λήξη';
$lang['filter'] = 'Φίλτρο';
$lang['more'] = 'Περισσότερα';
$lang['moretext'] = 'Περισσότερα';
$lang['name'] = 'Ονομασία';
$lang['news'] = 'Ειδήσεις';
$lang['newcategory'] = 'Νέα κατηγορία';
$lang['needpermission'] = 'Πρέπει να έχετε τα δικαιώματα πρόσβασης του \'%s\' για να εκτελέσετε αυτήν την εργασία.';
$lang['nocategorygiven'] = 'Δεν ορίσατε κατηγορία';
$lang['nocontentgiven'] = 'Δεν ορίσατε περιεχόμενο';
$lang['noitemsfound'] = '<strong>Δέν</strong> ευρέθηκαν στοιχεία για τήν κατηγορία: %s';
$lang['nopostdategiven'] = 'Δεν ορίστηκε ημερομηνία δημοσίευσης';
$lang['note'] = '<em>Σημείωση:</em> Οι ημερομηνίες πρέπει να έχουν την μορφή \'yyyy-mm-dd hh:mm:ss\'.';
$lang['notitlegiven'] = 'Δεν ορίστηκε τίτλος';
$lang['numbertodisplay'] = 'Αριθμός για εμφάνιση (το κενό εμφανίζει όλες τις εγγραφές)';
$lang['print'] = 'Εκτύπωση';
$lang['postdate'] = 'Ημερομηνία δημοσίευσης';
$lang['postinstall'] = 'Βεβαιωθείτε ότι ορίσατε το δικαίωμα "Τροποποίηση Ειδήσεων" στους χρήστες που θα διαχειρίζονται στοιχείων ειδήσεων.';
$lang['rsstemplate'] = 'Πρότυπο RSS';
$lang['selectcategory'] = 'Επιλογή κατηγορίας';
$lang['showchildcategories'] = 'Εμφάνιση υποκατηγοριών';
$lang['sortascending'] = 'Αύξουσα ταξινόμηση';
$lang['startdate'] = 'Αρχική ημερομηνία';
$lang['startrequiresend'] = 'Η εισαγωγή μιας αρχικής ημερομηνίας απαιτεί την εισαγωγή μιας τελικής στην συνέχεια';
$lang['submit'] = 'Υποβολή';
$lang['summary'] = 'Σύνοψη';
$lang['summarytemplate'] = 'Μορφή προτύπου σύνοψης';
$lang['title'] = 'Τίτλος';
$lang['options'] = 'Επιλογές';
$lang['useexpiration'] = 'Χρήση ημερομηνίας λήξης';
$lang['showautodiscovery'] = 'Ενεργοποίηση της εμφάνισης της υπερσύνδεσης του χαρακτηριστικού "Feed Auto-Discovery"';
$lang['autodiscoverylink'] = 'URL για το χαρακτηριστικό "Feed Auto-Discovery"  (κενό για το προεπιλεγμένο)';
$lang['helpnumber'] = 'Μέγιστος αριθμός εμφανιζόμενων στοιχείων =- Το κενό θα εμφανίσειόλα τα στοιχεία.';
$lang['helpmakerssbutton'] = 'Δημιουργείστε ένα κουμπί για την σύνδεση των ειδήσεων με ένα RSS.';
$lang['helpcategory'] = 'Εμφάνιση των στοιχείων μόνον αυτής της κατηγορίας. Χρησιμοποιείστε * μετα το όνομα για να εμφανιστούν και τα υπόλοιπα.  Μπορείτε να χρησιμοποιείσετε πολλαπλές κατηγορίες με χρήση του κόμματος. Το κενό θα εμφανίσει όλες τις κατηγορίες.';
$lang['helpmoretext'] = 'Κείμενο πυ θα εμφανίζεται στο τέλος μιας είδησης όταν το μέγεθος της ξεπερνά το μέγεθος της σύνοψης. Η πρεπιλοη είναι "περισσότερα..."';
$lang['helpsummarytemplate'] = 'Χρήση ενός διαφορετικού προτύπου για την εμφάνιση της σύνοψης ενός άρθρου.  Το πρότυπο 8α πρέπει να είναι στον κατάλογο modules/News/templates.';
$lang['helpdetailtemplate'] = 'Χρήση ενός διαφορετικού προτύπου για την εμφάνιση του κυρίως άρθρου.  Το πρότυπο 8α πρέπει να είναι στον κατάλογο modules/News/templates.';
$lang['helpsortby'] = 'Ταξινόμηση με βάσει ένα πεδίο.  Οι επιλογές είναι: "Ημερομηνία είδησης", "Σύνοψη", "Δεδομένα ειδήσεων", "Κατηγορία ειδήσεων", "Τίτλος ειδήσεων".  Η προεπιλογή είναι "Ημερομηνία είδησης".';
$lang['helpsortasc'] = 'Ταξινόμηση των στοιχείων των ειδήσεων σε αύξουσα σειρά με βάση την ημερομηνία και όχι φθίνουσα.';
$lang['helpdateformat'] = 'Μορφή εμφάνισης της ημερομηνίας δημοσίευσης άρθρου\'s.  Βασίζεται στην λειτουργία <a href="http://php.net/strftime" target="_blank">strftime</a> και μπορεί να χρησιμοποιειθεί στο πρότυπο σας με $entry->formatpostdate.  Δημιουργεί την προεπιλογή %x, που είναι η προεπιλογμένη μορφή ημερομηνίας με βάση τις τοπικές ρυθμίσεις του server\'s.';
$lang['help'] = <<<EOF
	<h3>Τι κάνει αυτό?</h3>
	<p>Οι ειδήσεις είναι ένα άρθρωμα για την εμφάνιση συμβάντων ειδήσεων στην σελίδα σας, παρόμοι με νησίδα HTML, αλλά με περισσότερες δυνατότητες!.  Μετά την εγκατάσταση του αρθρώματος προστίθεται μια σελίδα διαχείρισης ειδήσεων στο μενού διαχείρισης που σας επιτρέπει να προσθέσεται μια κατηγορία ειδήσεων.  Μόλις προστεθεί ή επιλεχθεί μια κατηγορία ειδήσεων, μία λίστα απο στοιχεία ειδήσεων που αφορούν την κατηγορία θα εμφανιστεί.  Μετά μπορείτε να προσθέσετε ,επεξεργαστείτε, ή να διαγράψετε στοιχεία αυτής της κατηγορίας ειδήσεων.</p>
	<h3>Ασφάλεια</h3>
	<p>Ο χρήστης πρέπει να ανήκει στην ομάδα με δικαίωμα 'Τροποποίηση Ειδήσεων' για να επιτραπεί προσθήκη, επεξεργασία ή διαγραφή εγγραφών ειδήσεων.</p>
	<h3>Πώς το χρησιμοποιώ?</h3>
	<p>Ο ποιό εύκολος τρόπος είναι σε συνάρτηση με την κεφαλίδα cms_module.  Ετσι εισάγεται το άρθρωμα στο πρότυπο ή σε σελίδα οπουδήποτε θέλετε να και εμφανίζει τα σοιχεία ειδήσεων.  Δείγμα κώδικα : <code>{cms_module module="news" number="5" category="beer"}</code></p>
EOF;
?>
