Repository: svn2github/cmsms
Catalog: cms/trunk/locale/*/LC_MESSAGES/cmsmadesimple.po
Languages: fr_fr

source: No title given!
fr_fr: Aucun titre entré !

source: No url given!
fr_fr: Aucun nom pour le lien entré !

source: No content entered!
fr_fr: Aucune donnée entrée !

source: No menu text given!
fr_fr: Aucun texte entré pour le menu !

source: Error inserting page
fr_fr: Erreur lors de la création de la page

source: No Access to Add Content
fr_fr: Vous ne possédez pas les droits suffisants pour ajouter du contenu

source: Preview
fr_fr: Aperçu

source: Add Content
fr_fr: Ajouter du contenu

source: Content Type
fr_fr: Type de contenu

source: Title
fr_fr: Titre

source: URL
fr_fr: Lien (URL)

source: Content
fr_fr: Contenu

source: Additional Editors
fr_fr: Autres éditeurs

source: Menu Text
fr_fr: Texte du menu

source: Show in Menu
fr_fr: Afficher dans le menu

source: Active
fr_fr: Actif

source: Submit
fr_fr: Envoyer

source: Cancel
fr_fr: Annuler

source: No group name given!
fr_fr: Aucun nom de groupe entré !

source: Error inserting group!
fr_fr: Erreur lors de la création du groupe !

source: No Access to Add Groups
fr_fr: Vous ne possédez pas les droits suffisants pour ajouter un groupe

source: Add Group
fr_fr: Ajouter un groupe

source: Name
fr_fr: Nom

source: No Section title given!
fr_fr: Aucun titre entré pour la section !

source: Error inserting section
fr_fr: Erreur lors de la création de la section

source: No Access to Add Sections
fr_fr: Vous ne possédez pas les droits suffisants pour ajouter une section

source: Add Section
fr_fr: Ajouter une section

source: No template name given!
fr_fr: Aucun nom entré pour le template !

source: No template content entered!
fr_fr: Le template est vide !

source: Error inserting template
fr_fr: Ereur lors de la création du template

source: No Access to Add Templates
fr_fr: Vous ne possédez pas les droits suffisants pour Ajouter un template

source: Add Template
fr_fr: Ajouter un template

source: Stylesheet
fr_fr: Feuille de style

source: No username given!
fr_fr: Aucun nom d'utilisateur entré !

source: No password given!
fr_fr: Aucun mot de passe entré !

source: Passwords do not match!
fr_fr: Les mots de passe ne correspondent pas !

source: Error inserting user!
fr_fr: Erreur lors de la création de l'utilisateur !

source: Add User
fr_fr: Ajouter un utilisateur

source: Password
fr_fr: Mot de passe

source: Password (again)
fr_fr: Mot de passe (encore)

source: Admin Log
fr_fr: Entrée Administrateur

source: User
fr_fr: Utilisateur

source: Item ID
fr_fr: Identité de l'élément

source: Item Name
fr_fr: Nom de l'élément

source: No Access to Modify Group Assignments
fr_fr: Vous ne possédez pas les droits suffisants pour modifier les assignations de groupe

source: No Access to Modify Group Permissions
fr_fr: Vous ne possédez pas les droits suffisants pour modifier les permissions des groupes

source: Permissions for group: ${group_name}
fr_fr: Permissions pour le groupe: ${group_name}

source: Cannot delete default page. Please set another page as default first.
fr_fr: Vous ne pouvez pas supprimer la page par défaut. Veuillez d'abord choisir une autre page comme page par défaut.

source: Section still being used by content pages. Please remove those first.
fr_fr: Cette section est encore utilisée par des pages. Veuillez les supprimer d'abord.

source: Template still being used by content pages. Please remove those first.
fr_fr: Ce template est encore utilisé par des pages. Veuillez les supprimer d'abord.

source: Error updating content!
fr_fr: Erreur lors de la mise à jour du contenu !

source: No Access to Edit this Page
fr_fr: Vous ne possédez pas les droits suffisants pour Editer cette page

source: Edit Content
fr_fr: Editer le contenu

source: Error updating group
fr_fr: Erreur lors de la mise à jour du groupe

source: No Access to Edit Groups
fr_fr: Vous ne possédez pas les droits suffisants pour Editer un groupe

source: Edit Group
fr_fr: Editer le groupe

source: Edit User Preferences
fr_fr: Modifier les préférences

source: Use WYSIWYG Editor for Content?
fr_fr: Utilisez le mode visuel (WYSIWYG) lors de l'édition ?

source: No Section name given!
fr_fr: Aucun nom de section entré !

source: Error updating section
fr_fr: Erreur lors de la mise à jour de la section

source: No Access to Edit Sections
fr_fr: Vous ne possédez pas les droits suffisants pour Editer des sections

source: No template content given!
fr_fr: Le template est vide !

source: Error updating template!
fr_fr: Erreur lors de la mise à jour du template

source: No Access To Edit Templates
fr_fr: Vous ne possédez pas les droits suffisants pour Editer des templates

source: Edit Template
fr_fr: Editer le template

source: Template Name
fr_fr: Nom du template

source: Passwords do not match
fr_fr: Les mots de passe ne correspondent pas

source: Error updating user
fr_fr: Erreur lors de la mise à jour de l'utilisateur

source: No Access to Edit Users
fr_fr: Vous ne possédez pas les droits suffisants pour Editer les utilisateurs

source: Edit User
fr_fr: Modifier l'utilisateur

source: Password<br />(leave blank to keep current password)
fr_fr: Mot de passe<br />(laisser vide pour conserver le mot de passe actuel)

source: CMS Admin System
fr_fr: CMS Panneau d'administration

source: Current Pages
fr_fr: Pages courantes

source: Owner
fr_fr: Propriétaire

source: Default
fr_fr: Défaut

source: Move
fr_fr: Déplacer

source: True
fr_fr: Vrai

source: False
fr_fr: Faux

source: Are you sure you want to set site\'s default page?
fr_fr: Etes vous sûr de vouloir l'utiliser comme page par défaut pour le site ?

source: Up
fr_fr: Haut

source: Down
fr_fr: Bas

source: View
fr_fr: Visualiser

source: Edit
fr_fr: Editer

source: Are you sure you want to delete?
fr_fr: Etes vous sûr de vouloir supprimer ?

source: Delete
fr_fr: Supprimer

source: No pages
fr_fr: Aucune page

source: Add New Content
fr_fr: Ajouter nouveau contenu

source: Current Groups
fr_fr: Groupes actuels

source: Group Name
fr_fr: Nom du groupe

source: Assignments
fr_fr: Assignations

source: Add New Group
fr_fr: Ajouter un groupe

source: Current Sections
fr_fr: Sections actuelles

source: Add New Section
fr_fr: Ajouter une nouvelle section

source: Current Templates
fr_fr: Templates actuels

source: Add New Template
fr_fr: Ajouter un nouveau template

source: Current Users
fr_fr: Utilisateurs actuels

source: Username
fr_fr: Nom d'utilisateur

source: Add New User
fr_fr: Ajouter un utilisateur

source: Username or Password incorrect!
fr_fr: Nom d'utilisateur ou mot de passe incorrect

source: Welcome ${name}
fr_fr: Bienvenue ${name}

source: Content Management
fr_fr: Gestion de contenu

source: Section Management
fr_fr: Gestion des sections

source: Template Management
fr_fr: Gestion des templates

source: User Management
fr_fr: Gestion utilisateurs

source: Group Management
fr_fr: Gestion groupes

source: User Preferences
fr_fr: Préférences

source: Tools
fr_fr: Outils

source: Show Site
fr_fr: Voir le site

source: Logout
fr_fr: Déconnexion

source: Click the Backup button to proceed with the database backup.
fr_fr: Clickez sur le bouton Backup pour lancer la sauvegarde de la base de données

source: Enter your backup sql filename and click Restore to wipe out your database and rebuild it. Use with caution.
fr_fr: Entrer le nom du fichier sql de backup et clickez sur Restaurer pour vider la base de données et charger les nouvelles données. A utiliser avec précaution.

source: Working....
fr_fr: En cours...

source: Backup complete. Wrriten to file:
fr_fr: Sauvegarde terminée. Sauvegardé dans le fichier :

source: Restore complete:
fr_fr: Restauration complète :
