<?php
$lang['word'] = 'Word';
$lang['count'] = 'Count';
$lang['confirm_clearstats'] = 'Είστε βέβαιοι ότι θέλετε να διαγράψετε οριστικά όλα τα στατιστικά στοιχεία;';
$lang['clear'] = 'Clear';
$lang['statistics'] = 'Στατιστικά στοιχεία';
$lang['param_action'] = 'Καθορίστε τον τρόπο λειτουργίας του δομοστοιχείου. Οι αποδεκτές τιμές είναι \'προεπιλεγμένο\' και \'λέξεις κλειδιά\'.  Η λειτουργία των λέξεων κλειδιών μπορεί να χρησιμοποιηθεί για τη δημιουργία μιας λίστας λέξεων που χωρίζονται με κόμμα και είναι κατάλληλες για χρήση σε ένα meta tag που περιλαμβάνει λέξεις κλειδιά.';
$lang['param_count'] = 'Εφόσον χρησιμοποιηθεί με τη λειτουργία των λέξεων κλειδιών αυτή η παράμετρος θα επιτρέπει την έξοδο ορισμένου μόνο αριθμού λέξεων';
$lang['param_pageid'] = 'Εφαρμόσιμη μόνο με τη λειτουργία λέξεων κλειδιών, αυτή η παράμετρος μπορεί να χρησιμοποιηθεί για τον καθορισμό ενός διαφορετικού pageid για το οποίο θα δοθούν αποτελέσματα';
$lang['param_inline'] = 'Αν αληθεύει, η έξοδος της φόρμας αναζήτησης θα αντικαταστήσει το αρχικό περιεχόμενο της καρτέλας \'αναζήτηση\' κατά τη δημιουργία μπλοκ περιεχομένου.  Χρησιμοποιήστε αυτήν την παράμετρο αν το πρότυπο σας έχει πολλά μπλοκ περιεχομένου και δεν επιθυμείτε την αντικατάσταση του προεπιλεγμένου μπλοκ περιεχομένου από την έξοδο της αναζήτησης';
$lang['param_passthru'] = 'Αποστολή τιμών παραμέτρων προς τα καθορισμένα δομοστοιχεία.  Το μορφότυπο καθεμίας από αυτές τις παραμέτρους  είναι: "passtru_MODULENAME_PARAMNAME=\'τιμή\'" π.χ.: passthru_News_detailpage=\'νέες λεπτομέρειες\'"';
$lang['param_modules'] = 'Περιορισμός των αποτελεσμάτων της αναζήτησης σε τιμές οι οποίες συμπεριλαμβάνονται στο ευρετήριο από την καθορισμένη λίστα δομοστοιχείων (τα στοιχεία της οποίας χωρίζονται με κόμμα) ';
$lang['searchsubmit'] = 'Υποβολή';
$lang['search'] = 'Αναζήτηση';
$lang['param_submit'] = 'Κείμενο που θα τοποθετηθεί στο πλήκτρο υποβολή';
$lang['param_searchtext'] = 'Κείμενο που θα τοποθετηθεί στο πλαίσιο αναζήτησης';
$lang['prompt_searchtext'] = 'Προεπιλεγμένο Κείμενο Αναζήτησης';
$lang['param_resultpage'] = 'Σελίδα όπου εμφανίζονται τα αποτελέσματα της αναζήτησης.  Μπορεί να είναι είτε μια σελίδα alias ή ένα id. Χρησιμοποιείται για να επιτρέπει την εμφάνιση των αποτελεσμάτων σε πρότυπο διαφορετικό αυτού της φόρμας αναζήτησης';
$lang['description'] = 'Δομοστοιχείο για την ιστοσελίδα αναζήτησης και το περιεχόμενο των άλλων δομοστοιχείων.';
$lang['reindexallcontent'] = 'Επανευρετηρίαση ολόκληρου του περιεχομένου';
$lang['reindexcomplete'] = 'Ολοκλήρωση Επανευρετηρίασης!';
$lang['stopwords'] = 'Stop Words';
$lang['searchresultsfor'] = 'Αναζήτηση αποτελεσμάτων για';
$lang['noresultsfound'] = 'Δεν βρέθηκαν αποτελέσματα!';
$lang['timetaken'] = 'Χρόνος που απαιτήθηκε';
$lang['usestemming'] = 'Χρήση περιορισμού λέξεων (μόνο Αγγλικά)';
$lang['searchtemplate'] = 'Αναζήτηση Προτύπου';
$lang['resulttemplate'] = 'Πρότυπο Αποτελέσματος';
$lang['submit'] = 'Υποβολή';
$lang['sysdefaults'] = 'Επαναφορά Προεπιλεγμένων Ρυθμίσεων';
$lang['searchtemplateupdated'] = 'Ενημέρωση  Προτύπου Αναζήτησης';
$lang['resulttemplateupdated'] = 'Ενημέρωση Προτύπου Αναζήτησης';
$lang['restoretodefaultsmsg'] = 'Η λειτουργία αυτή θα επαναφέρει το περιεχόμενο του προτύπου στις προεπιλεγμένες ρυθμίσεις του συστήματος. Είστε βέβαιοι ότι θέλετε να συνεχίσετε?';
$lang['options'] = 'Επιλογές';
$lang['eventdesc-SearchInitiated'] = 'Αποστολή όταν αρχίζει η αναζήτηση.';
$lang['eventdesc-SearchCompleted'] = 'Αποστολή όταν ολοκληρώνεται η αναζήτηση.';
$lang['eventdesc-SearchItemAdded'] = 'Αποστολή όταν συμπεριλαμβάνεται στο ευρετήριο ένα νέο στοιχείο.';
$lang['eventdesc-SearchItemDeleted'] = 'Αποστολή όταν ένα στοιχείο διαγράφεται από το ευρετήριο.';
$lang['eventdesc-SearchAllItemsDeleted'] = 'Αποστολή όταν διαγράφονται όλα τα στοιχεία από το ευρετήριο.';
$lang['eventhelp-SearchInitiated'] = '<p>Αποστολή όταν αρχίζει η αναζήτηση.</p>
<h4>Παράμετροι</h4>
<ol>
<li>Κείμενο για το οποίο έγινε αναζήτηση.</li>
</ol>
';
$lang['eventhelp-SearchCompleted'] = '<p>Αποστολή όταν ολοκληρώνεται η αναζήτηση.</p>
<h4>Παράμετροι</h4>
<ol>
<li>Κείμενο για το οποίο έγινε αναζήτηση.</li>
<li>Παράθεση των ολοκληρωμένων αποτελεσμάτων.</li>
</ol>
';
$lang['eventhelp-SearchItemAdded'] = '<p>Αποστολή όταν συμπεριλαμβάνεται στο ευρετήριο ένα νέο στοιχείο.</p>
<h4>Παράμετροι</h4>
<ol>
<li>Όνομα δομοστοιχείου.</li>
<li>Id του στοιχείου.</li>
<li>Πρόσθετη Ιδιότητα.</li>
<li>Περιεχόμενο στο ευρετήριο και προσθήκη.</li>
</ol>
';
$lang['eventhelp-SearchItemDeleted'] = '<p>Αποστολή όταν ένα στοιχείο διαγράφεται από το ευρετήριο.</p>
<h4>Παράμετροι</h4>
<ol>
<li>Όνομα δομοστοιχείου.</li>
<li>Id του στοιχείου.</li>
<li>Πρόσθετη Ιδιότητα.</li>
</ol>
';
$lang['eventhelp-SearchAllItemsDeleted'] = '<p>Αποστολή όταν διαγράφονται όλα τα στοιχεία από το ευρετήριο.</p>
<h4>Παράμετροι</h4>
<ul>
<li>Καμία</li>
</ul>
';
$lang['help'] = '<h3>Ποια είναι η λειτουργία της;</h3>
<p>Η αναζήτηση είναι ένα δομοστοιχείο για την αναζήτηση "βασικού" περιεχομένου και περιεχομένου σε ορισμένα καταχωρισμένα δομοστοιχεία.  Εισάγετε μία ή δύο λέξεις και σας επιστρέφει αντίστοιχα, σχετικά αποτελέσματα.</p>
<h3>Πώς μπορώ να τη χρησιμοποιήσω;</h3>
<p>Ο ευκολότερος τρόπος να χρησιμοποιηθεί είναι με το wrapper tag {search} (περιβάλλει το δομοστοιχείο με ένα tag για την απλούστευση της σύνταξης). Έτσι θα εισαχθεί το δομοστοιχείο σε οποιοδήποτε σημείο του προτύπου ή της σελίδας σας και θα εμφανιστεί η φόρμα αναζήτησης.  Ο κώδικας θα είναι περίπου ως εξής: <code>{search}</code></p>
<h4>Με ποιο τρόπο μπορώ να αποτρέψω το να συμπεριληφθεί  κάποιο περιεχομένο στην ευρετηρίαση;</h4>
<p>Το δομοστοιχείο αναζήτησης δεν θα αναζητήσει τυχόν "μη ενεργές" σελίδες. Εντούτοις, κατά περίπτωση, όταν χρησιμοποιείτε το δομοστοιχείο CustomContent ή κάποια άλλη έξυπνη λογική (smarty logic) για την παρουσίαση διαφορετικού περιεχομένου σε διαφορετικές ομάδες χρηστών συνιστάται η μη ευρετηρίαση ολόκληρης της σελίδας ακόμα κι αν είναι ενεργή.  Για να γίνει αυτό τοποθετήστε το ακόλουθο tag οπουδήποτε στη σελίδα <em><!-- pageAttribute: NotSearchable --></em> Όταν το δομοστοιχείο αναζήτησης αντιληφθεί αυτό το tag στη σελίδα τότε δεν θα συμπεριλάβει στο ευρετήριο το περιεχόμενο της σελίδας αυτής.</p>
<p>Το tag <em><!-- pageAttribute: NotSearchable --></em> μπορεί επίσης να τοποθετηθεί στο πρότυπο.  Αν γίνει αυτό καμία από αυτές τις συνημμένες σελίδες σε αυτό το πρότυπο δεν θα συμπεριληφθεί στο ευρετήριο.  Οι σελίδες αυτές θα συμπεριληφθούν ξανά στο ευρετήριο εφόσον καταργηθεί αυτό το tag</p>
';
$lang['changelog'] = '<ul>
<li>1.1 - Αρχική κυκλοφορία</li>
<li>1.2 - Απρίλιος 2007 (calguy1000)
  <p>Προσθήκη δυνατότητας περιορισμού των αποτελεσμάτων σε ορισμένα δομοστοιχεία και αποστολής τιμών παραμέτρων και παραμέτρων στα διάφορα δομοστοιχεία επιτρέποντας διαφορετική μορφοποίηση της εξόδου./p>
  <p>Μετατροπή ώστε το δομοστοιχείο αναζήτησης να μπορεί να χρησιμοποιηθεί σε μη προεπιλεγμένα μπλοκ περιεχομένου.</p>
</li>
<li>1.3 - Μάϊος 2007 (calguy1000)
  <p>Προσθέτει κλήσεις προς το SetParameterType</p>
</li>
<li>1.4 - Nοέμβ. 2007 (calguy1000)
  <p>Προσθέτει τη λειτουργία των λέξεων κλειδιών.</p>
  <p>Αποκαθιστά ένα πρόβλημα που αφορά τη χρήση της παραμέτρου resultpage σε μια σελίδα το πρότυπο της οποίας διαφέρει κατά πολύ.</p>
</li>
<li>1.4.1 - Νοέμβ. 2007 (calguy1000)
  <p>Μικρές ρυθμίσεις ώστε τα php tags και οι χαρακτήρες στίξης να μην συμπεριληφθούν στο ευρετήριο.</p>
  <p>Αποκατάσταση των προβλημάτων της μεθόδου Fix the VisibleToAdminUser</p>
</li>
<li>1.5 - Μάρ. 2008 (calguy1000)
  <p>Τώρα συλλογή στατιστικών στοιχείων για τις 50 λέξεις οι οποίες αναζητώνται συχνότερα.</p>
  <p>Προσθήκη δυνατότητας εμφάνισης στατιστικών στοιχείων και διαγραφής τους από τον πίνακα διαχείρισης.</p>
  <p>Ευκολότερη διαμόρφωση του πλήκτρου αναζήτησης και της ετικέτας του.</p>
  <p>Τώρα μόνο ενεργές σελίδες ευρετηρίου</p>
</li>
<li>1.5.1 - Ιούλιος 2008 (calguy1000)
  <p>Μικρές αλλαγές στο πρότυπο για την επαναφορά της προηγούμενης συμπεριφοράς 1.5</p>
  <p>Τώρα: διαφυγή (escape) οποιωνδήποτε χαρακτήρων αναζήτησης όρων οι οποίοι έχουν ιδιαίτερη σημασία σε συνηθισμένες εκφράσεις</p>
  <p>Μικρές βελτιώσεις και ρυθμίσεις</p>
</li>
</ul>';
?>